In [1]:
from simpledbf import Dbf5
import pandas as pd

PyTables is not installed. No support for HDF output.
SQLalchemy is not installed. No support for SQL output.

In [6]:
tdexport = Dbf5(r'..\databases\tdexport.dbf', codec='utf-8')
tdexport.to_dataframe()

,D_EVENT_ID,D_SEC_NUM,D_PAIR_NUM,D_MEM_ID,D_NAME,D_STATE,D_RATING,D_RND01
0,NaN,1,1,00000000,"Carlsen, Magnus",NaN,2878,L3W
1,NaN,1,2,00000000,"Dubov, Daniil",NaN,2780,L4B
2,NaN,1,3,00000000,"Ambethkar, Hari",NaN,1906,W1B
3,NaN,1,4,00000000,"Chang, Daniel Donggun",NaN,1045,W2W

In [7]:
tsexport = Dbf5(r'..\databases\tsexport.dbf', codec='utf-8')
tsexport.to_dataframe()

,S_EVENT_ID,S_SEC_NUM,S_SEC_NAME,S_R_SYSTEM,S_TIMECTL,S_CTD_ID,S_ATD_ID,S_TRN_TYPE,S_TOT_RNDS,S_LST_PAIR,S_BEG_DATE,S_END_DATE,S_SCH_LVL,S_GR_PRIX,S_GP_PTS,S_FIDE
0,NaN,1,Open,R,NaN,15173194,NaN,S,1,4,20210210,20210210,NaN,N,NaN,N

In [8]:
thexport = Dbf5(r'..\databases\thexport.dbf', codec='utf-8')
thexport.to_dataframe()

,H_FORMAT,H_PROGRAM,H_EVENT_ID,H_NAME,H_TOT_SECT,H_BEG_DATE,H_END_DATE,H_AFF_ID,H_CITY,H_STATE,H_ZIPCODE,H_COUNTRY,H_SENDCROS,H_CTD_ID,H_ATD_ID,H_OTHER_TD
0,2C,SWISSSYS10,NaN,Test- Open,1,20210210,20210210,A5013852,Folsom,CA,95630,United States,N,15173194,NaN,NaN